week2/week2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Week 2 Review : Group 07</title>
<!-- 2014-04-30 Wed 17:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jared Smith, Sam Beveridge, Calvin Lam" />
<link rel="stylesheet" type="text/css" href="css/week2-style.css" />
<link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro' rel='stylesheet' type='text/css'/>
</head>
<body>
<div id="content">
<h1 class="title">Week 2 Review : Group 07</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Our Home Page</a></li>
<li><a href="#sec-2">Github Source Page</a></li>
<li><a href="#sec-3">Team Members</a></li>
<li><a href="#sec-4">Sam Beveridge</a>
<ul>
<li><a href="#sec-4-1">User Login</a></li>
</ul>
</li>
<li><a href="#sec-5">Calvin Lam</a>
<ul>
<li><a href="#sec-5-1">Website Design</a></li>
</ul>
</li>
<li><a href="#sec-6">Jared Smith</a>
<ul>
<li><a href="#sec-6-1">Database Design</a></li>
</ul>
</li>
<li><a href="#sec-7">Project Status</a></li>
<li><a href="#sec-8">Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a href="http:deepblue.cs.camosun.bc.ca/~comp19907/">Our Home Page</a></h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><a href="https:github.com/jrods/comp199">Github Source Page</a></h2>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Team Members</h2>
<div class="outline-text-2" id="text-3">
<p class="verse">
Sam Beveridge<br  />
Calvin Lam<br  />
Jared Smith<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Sam Beveridge</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">User Login</h3>
<div class="outline-text-3" id="text-4-1">
<p class="verse">
I have set up a login/register which makes use of mySQL databases and securely stores passwords in the database.<br  />
On the register page reCAPTCHA is implemented in order to protect against spam bots. The website is using session<br  />
data in order to remember who is logged in and can see whether the user is logged on or off. The website can also<br  />
return the username a logged-in user to the webpage. Certain pages are protected from viewing depending on<br  />
whether or not you have logged in as a user or not.<br  />
</p>
<ul class="org-ul">
<li>Plans:
<ul class="org-ul">
<li>implement into home page using transparent DIV popup
</li>
<li>add login attempt limits
</li>
<li>email verification
</li>
<li>implement session data into rest of webpage
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Calvin Lam</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Website Design</h3>
<div class="outline-text-3" id="text-5-1">
<p class="verse">
On the webpage design, I have desgined a basic skelton of the webpage using CSS and HTML. We plan to add<br  />
more onto the webpage and make it more dynamic with without the need to reload a new page and other similar<br  />
features. The links on the menu bar have not been planned out yet. Some problems I've encounterd were in the<br  />
CSS highlighting links to a specific color and the hover method. Other than that the webpage has gone very smoothly.<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Jared Smith</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Database Design</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Using MySQLWorkbench, I was able to create a base for our website's design structure.
</li>
<li>There are 5 main tables:
<ul class="org-ul">
<li>User
</li>
<li>Artist
</li>
<li>Album
</li>
<li>Song
</li>
<li>Receipt
</li>
</ul>
</li>
<li>The main problem I had designing the database was getting primary and foreign keys working, but eventually got everything to work (for now). Later on, the database will need to expand with more columns, which shouldn't be too much of a problem.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Project Status</h2>
<div class="outline-text-2" id="text-7">
<p class="verse">
Currently the project is on schedule, detailed by our gantt chart. We were able to design a basic database, query with php<br  />
and display the results in html. We have a basic index page for our website and will be able to add our other modules to<br  />
make it somewhat useful. We were also able to get a basic login/register form to allow for people to sign up and have a<br  />
user account. This coming week is abit short compared to the last milestone; We can manage (I think, we'll see) to stay on schedule.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Links</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="../project.html">Main Project Outline</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jared Smith, Sam Beveridge, Calvin Lam</p>
<p class="date">Created: 2014-04-30 Wed 17:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
